V2-Tech/SMD_Solder_Station---STM32/Core/Src/main.c
  /*Configure GPIO pin : PulsEncoder_Pin */
  GPIO_InitStruct.Pin = PulsEncoder_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(PulsEncoder_GPIO_Port, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	if(GPIO_Pin == PulsStart_Pin)
	{
		if (GraphicVar._ActualPage == PageMain)
		{
			EnablePWMOut = true;
		}
		else if (GraphicVar._ActualPage == PageTuning)
		{
			StartTuning = true;
		}
	}
	else if (GPIO_Pin == PulsStop_Pin)
	{
		if (GraphicVar._ActualPage == PageMain)
		{
			EnablePWMOut = false;
		}
		else if (GraphicVar._ActualPage == PageTuning)
		{
			StartTuning = false;
		}
	}

	if(GPIO_Pin == PulsEncoder_Pin && HAL_GPIO_ReadPin(PulsEncoder_GPIO_Port, PulsEncoder_Pin) == GPIO_PIN_RESET)
	{
		GraphicVar._PulsEncoderPressed = true;
		GraphicVar._PulsEncoderReleased = false;
		osTimerStart(PulsEncoderTimerHandle, PULS_HOLDED_TIME_MS/portTICK_PERIOD_MS);
	}
	if(GPIO_Pin == PulsEncoder_Pin && HAL_GPIO_ReadPin(PulsEncoder_GPIO_Port, PulsEncoder_Pin) == GPIO_PIN_SET)
	{
		osTimerStop(PulsEncoderTimerHandle);
		GraphicVar._PulsEncoderPressed = false;
		GraphicVar._PulsEncoderReleased = true;
		GraphicVar._PulsEncoderHolded = false;
	}
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartMainTask */
/**
  * @brief  Function implementing the MainTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartMainTask */
void StartMainTask(void const * argument)
{
  /* init code for USB_DEVICE */
  MX_USB_DEVICE_Init();
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
	  if (GraphicVar._ActualPage == PageMain)
	  {
		  if (EnablePWMOut && TempFilter.FilterOK)
		  {
		  	  GraphicVar._ActualHeatState = Heating;
		  	  TIM2->CCR2 = PIDUpdate(&TempPID, FilteredTemperature);
		  }
		  else
		  {
		  	  GraphicVar._ActualHeatState = HeatOFF;
		  	  TIM2->CCR2 = 0;
		  }
		   sprintf((uint8_t *) logBuf, "PID_P: %.1f, PID_I: %.1f, PID_D: %.1f\r\n",
		   					  TempPID.PID_P, TempPID.PID_I, TempPID.PID_D);
		  CDC_Transmit_FS((uint8_t *) logBuf, strlen(logBuf));

		  osDelay(1000/PID_LOOP_FREQUENCY_HZ);
	  }
	  else if (GraphicVar._ActualPage == PageTuning)
	  {
		  if (StartTuning)
		  {
			  int8_t TuningStatus = PID_AutoTuneUpdate(&TempAutoTuneVar, &FilteredTemperature, &TIM2->CCR2);
			  if (TuningStatus == 1)
			  {
				  PID_AutoTuneCompute(&TempAutoTuneVar);
				  PID_AutoTuneGetCoeff(&TempAutoTuneVar, &TempPID);
				  PIDNewCoeff(&TempPID, TempAutoTuneVar.Kp_Tuned, TempAutoTuneVar.Ki_Tuned, TempAutoTuneVar.Kp_Tuned);
				  StartTuning = false;
			  }
		  }
		  else
		  {
			  PID_AutoTuneStop(&TempAutoTuneVar);
			  TIM2->CCR2 = 0;
		  }
		  osDelay(1);
	  }
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartGraphicTask */
/**
* @brief Function implementing the GraphicTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartGraphicTask */
void StartGraphicTask(void const * argument)
{
  /* USER CODE BEGIN StartGraphicTask */
  /* Infinite loop */
  for(;;)
  {
	  // Lettura valore encoder rotativo
	  EncoderRead(&GraphicVar, &htim3);
	  printf("Signed encoder actual value: %d\r", GraphicVar.SignedEncActValue);

	  // Aggiornamento OLED
	  Graphic(&GraphicVar, &TempFilter, &TempPID, &TempAutoTuneVar);

	  osDelay(20);
  }
  /* USER CODE END StartGraphicTask */
}

/* ReadTempTimerCallback function */
void ReadTempTimerCallback(void const * argument)
{
  /* USER CODE BEGIN ReadTempTimerCallback */
	Max6675_Read_TempValue(&ActTemperature);
	FilteredTemperature = LPFilterUpdate(&TempFilter, ActTemperature);
	/*
	// Graph 1
	sprintf((uint8_t *) logBuf, "Setpoint: %.1f, Actual Temp: %.1f, Actual PWM: %d\r\n",
				  TempPID.Setpoint, FilteredTemperature, TIM2->CCR2);
	CDC_Transmit_FS((uint8_t *) logBuf, strlen(logBuf));
	*/
	/*
	// Graph 2
	sprintf((uint8_t *) logBuf, "PID_P: %.1f, PID_I: %.1f, PID_D: %.1f\r\n",
					  TempPID.PID_P, TempPID.PID_I, TempPID.PID_D);
	CDC_Transmit_FS((uint8_t *) logBuf, strlen(logBuf));
	*/
	/*
	// Graph 3
	sprintf((uint8_t *) logBuf, "Actual Temp: %.1f, Actual PWM: %d, PID_D: %.1f\r\n",
					  FilteredTemperature, TIM2->CCR2, TempPID.PID_D);
	CDC_Transmit_FS((uint8_t *) logBuf, strlen(logBuf));
	 */
  /* USER CODE END ReadTempTimerCallback */
}

/* PulsEncoderTimerCallback function */
void PulsEncoderTimerCallback(void const * argument)
{
  /* USER CODE BEGIN PulsEncoderTimerCallback */
	if (GraphicVar._ActualPage == PageMain)
	{
		GraphicVar._ActualPage = PageTuning;
	}
	else if (GraphicVar._ActualPage == PageTuning)
	{
		GraphicVar._ActualPage = PageMain;
	}

	GraphicVar._PulsEncoderHolded = true;
  /* USER CODE END PulsEncoderTimerCallback */
}

 /**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
